Revit 2027 API
TriOrQuadFacet Methods
The TriOrQuadFacet type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetVertexIndex |  Returns the index of the specified vertex of this facet (as an index into the external array of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets).
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace